// 26년 나혼자 sql 분석 / 단어 마무리

// 용어
// 스키마: MySQL 내 DB
// 데이터 형식: 문자형(CHAR),정수형(INT) 등 열에 저장될 데이터 형식
// 예약어: SELECT, FROM, WHERE 등과 같은 기준애 약속된 SQL
// 기본키: 열에 지정, 각 항목 구분하는 유일한 값.

// 확인 문제
// 1. 테이블 구축절차 
// 정답: 데이터 베이스 만들기- 테이블만들기-데이터 입력하기-데이터 조회하기

// 2. 데이터베이스는  테이블 저장하는 공간으로  스키마라고도 부릅니다

// 3. MySQL 워크벤치 메뉴 이용하여 SQL문 구축 각 설명 의미하는 것
// 3-1) 데이터 수정할 때 사용 : UPDATE
// 3-2) 데이터 조회할 때 사용 : SELECT
// 3-3) 테이블이나 데이터베이스 만들때 사용 : CREATE
// 3-4) 데이터 삭제할 때 사용 : DELETE

// 의미와 관련된 용어?
// 4-1) 데이터 형식 중 소수점 없는 정수형 : INT
// 4-2) 비어 있는 값 을 허용하지 않음 : NOT NULL
// 4-3) 데이터 형식 중에서 문자형 : CHAR
// 4-4) 데이터 형식 중에서 날짜형 : DATE

// 5. SELECT문에 대한 설명으로 옳은 것은 고르세요?
const userName = SELECT * FROM 테이블_이름 WHERE 열_이름 = '값'?
// ◆ 특정 값에 해당하는 행만 조회
// ◆ 특정 값에 해당하는 열만 조회  
// ◆ 모든 행의 모든 열을 조회  
// ◆ 모든 행의 특정 열만 조회  


